Repository: oscarahalvorsen/masterproject
Catalog: datacollecting/MAALFRID/tmx/forsvaret.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: explain the operation, running and maintenance of the Navy vessels and knowledge of management related to this.
nb: forklare om drift, vedlikehold og operasjon av Sjøforsvarets fartøyer og kunnskap om ledelse knyttet til dette.

source: This with a focus on individual and collective ability to make decisions, as well as to create support and interaction for these decisions.
nb: Dette med søkelys på individuell og kollektiv evne til å ta beslutninger, samt å skape oppslutning og samhandling for disse beslutninger.

source: How does a comprehensive international and/or national mandate turn into an military air force mission?
nb: Hvordan omsettes et overordnet internasjonalt og/eller nasjonalt mandat til et luftmilitært oppdrag?

source: • be able to apply relevant academic tools
nb: • kunne anvende relevante faglige verktøy

source: Regulations for machines (FOR-2009-05-20-544) and regulations relating to pressurised equipment.
nb: Maskinforskriften (FOR-2009-05-20-544) og forskrifter om trykkpåsatt utstyr.

source: identify, plan, coordinate and implement configuration, installation, operation, defence of networks and information infrastructure, engineering projects, trials and experiments, both independently and in teams.
nb: identifisere, planlegge, koordinere og gjennomføre konfigurasjon, installasjon, drift, forsvar av nettverk og informasjonsinfrastruktur, ingeniørfaglige prosjekter, forsøk og eksperimenter, både selvstendig og i team.

source: The main purpose of the course is thus to develop the competence of the cadets to plan and direct air operations and to safeguard themselves and groups in international operations in peace, crisis and war.
nb: Hovedhensikten med emnet er dermed å utvikle kadettenes kompetanse til å planlegge og lede luftoperasjoner og ivareta seg selv og grupper i internasjonale operasjoner i fred, krise og krig.

source: The course provides an introduction to organising, computing, and writing a bachelor dissertation.
nb: Emnet gir innføring i organisering, databehandling og skriving av en bacheloroppgave.

source: • assess a telecommunications system in terms of bitrate, error rate, channel capacity and other central telecommunication technology parameters
nb: • vurdere et telekommunikasjonssystem med tanke på bitrate, feilrate, kanalkapasitet og andre sentrale telekommunikasjonsteknologiske parametere

source: Design principles for defensible II
nb: Designprinsipper for forsvarbar INI

source: describe the historical development in the field of MilGeo
nb: beskrive den historiske utviklingen innen fagfeltet MilGeo

source: A teaching weeks includes 4 hours instruction/lectures in plenary for the most important courses of the course’s curriculum.
nb: En undervisningsuke inneholder 4 timer undervisning/forelesninger i plenum for de viktigste delemner av emnets pensum.

source: Cultural understanding, culture and negotiation on meaning.
nb: Kulturforståelse, kultur og forhandling om mening.

source: The First Cadet can be singled out on weekend voyages and navigation exercises and shall as a minimum attend to:
nb: Ansvarlig kadett vil kunne utpekes for helgeseilas og navigasjonsøvelsene og skal som minimum ivareta:

source: In addition to military vocational training, which includes leadership and military power, the cadets receive nautical and operational expertise.
nb: I tillegg til den militære profesjonsutdanningen, som inneholder lederskap og militærmakt, får kadettene nautisk og operativ kompetanse.

source: • problematise ethical, economic, environmental and social challenges connected to military activities
nb: • problematisere rundt etiske, økonomiske, miljø- og samfunnsmessige utfordringer ved militær virksomhet

source: an understanding of the basic principles of effective procedures for good cooperation (CRM).
nb: forståelse for grunnprinsippene av effektive prosedyrer for godt samarbeid på bro(CRM).

source: Eventually, the module and developments in the scenario will confront the cadets with a number of military challenges on the ground to which resolutions must be found by drawing up operational plans of recommendation for their organisation.
nb: Etter hvert vil delemnet og utviklingen i scenariet stille kadettene ovenfor en rekke landmilitær problemstillinger som de skal finne løsninger på ved å utarbeide operasjonsplaner for anbefalt organisasjon.

source: • Functions with two and three variables
nb: • Funksjoner med to og tre variable

source: Including correct method for source use.
nb: Herunder korrekt metode for kildebruk.

source: Pilots for transport aircraft and maritime surveillance aircraft are trained in Florida and Texas under the auspices of the US Navy.
nb: Flygere til transportfly og maritime overvåkningsfly utdannes i Florida og Texas i regi av US Navy.

source: The dynamics segment and the chemistry segment make up 75% and 25%, respectively, of the entire course.
nb: Dynamikk-delen og kjemi-delen utgjør henholdsvis 75 % og 25 % av hele emnet.

source: Roles, responsibilities and authorities for the operation and management of Norwegian Armed Forces' and NATO's II
nb: Roller, ansvar og myndighet for drift og forvaltning av Forsvarets og NATOs INI

source: Motor and generator operation.
nb: Løfteteknikk/utstyr /prosedyrer og regelverk.

source: These are combined to solve complex and complex problems.
nb: Disse kombineres for å løse sammensatte og komplekse problemstillinger.

source: hydrostatic tables, Bonjean curves, load line marks, submarine hydrostatics, stability, trim and equilibrium polygons.
nb: hydrostatiske tabeller, Bonjean-kurver, lastemerker, Undervannsbåters hydrostatikk, stabilitet, trim og likevektspolygoner.

source: The physical session no 2 (three days) contains the topic Operational Logistics in Practice.
nb: Fysisk samling nr 2 (tre dager) har tema Operativ logistikk i praksis.

source: The teaching (2 hours per week) includes, among others, training and testing in translation, reading and listening comprehension.
nb: Undervisningen (2 timer per uke) innebærer blant annet trening og testing i oversettelse, lese- og lytteforståelse.

source: If necessary, time is also set aside for individual and collective feedback, and writing of the reflective note.
nb: Ved behov settes det av tid til individuelle og kollektive tilbakemeldinger, og skriving av refleksjonsnotat.

source: • First and second order differential equations
nb: • Første og andre ordens differensiallikninger

source: In addition, the routines for the day-to-day operations of platoons are reviewed by the Armed Forces.
nb: I tillegg gjennomgås rutiner for daglig drift ved avdelinger i Forsvaret.

source: account for how the Great Powers, the UN, the EU and NATO, along with international law affect Norwegian defence and security policy.
nb: gjøre rede for hvordan stormaktene, FN, EU og NATO samt internasjonal rett påvirker norsk forsvars- og sikkerhetspolitikk.

source: explain how military forces work together with governmental and non-governmental organisations and agencies.
nb: forklare hvordan militære styrker samspiller med statlige og ikke- statlige organisasjoner og aktører.

source: an understanding of CRM
nb: forståelse av CRM

source: The remaining ECDIS instruction is completed in Navigation Systems 1.
nb: Resterende undervisning i ECDIS gjennomføres i Navigasjonssystemer 1.

source: explain key theories on group development and social psychology.
nb: forklare sentrale teorier om gruppeutvikling og sosialpsykologi.

source: • Participation in military basic training period and autumn exercise “Initial Entry”
nb: • Deltagelse på militær grunnlagsperiode og høstøvelse «Initial Entry»

source: Student presentations, compulsory submissions, guidance and self-studies.
nb: Elevframføringer, obligatoriske innleveringer, veiledning og selvstudium.

source: • apply principles, methods and techniques for securing information systems
nb: • benytte prinsipper, metoder og teknikker for sikring av informasjonssystemer

source: explain how winter conditions affect soldiers, units and mission solutions.
nb: forklare hvordan vinterforhold påvirker soldater, avdelinger og oppdragsløsning.

source: Each cadet sails his/her own plans along the same fairways in the Bergen South or Bergen North areas.
nb: Hver kadett seiler sine egne planer i de samme ledene i områdene Bergen syd eller Bergen Nord.

source: Read and understand different texts and recognise and transmit relevant teaching between different contexts, as well as formulate your own thoughts and reflections coherently both in spoken, written and idiomatically correct English.
nb: lese og forstå ulike tekster og gjenkjenne og overføre relevant læring mellom ulike kontekster, samt formulere egne tanker og refleksjoner koherent muntlig og skriftlig i idiomatisk korrekt engelsk.

source: Introduction to the officer as a person and role model.
nb: Innføring i offiseren som person og rollemodell.

source: Hereinafter, work tasks run by the practice platoon are outlined, and Line Command Courses and a 40-hour HSE Course are given.
nb: Videre defineres arbeidsoppgaver gitt av praksisavdelingen, og det gjennomføres linjelederkurs og 40-timers HMS-kurs.

source: After completing the course, the cadet will:
nb: Etter fullført emne vil kadetten:

source: After completing the course, the cadets must:
nb: Etter fullført emne skal kadettene kunne:

source: knowledge of stowage and securing of cargo on board ships, including loading and unloading tools for securing and stowage.
nb: kjennskap til stuing og sikring av last om bord på skip, herunder laste- og losseredskaper for sikring og stuing.

source: Practical training in the form of an exercise, during which cadets encounter given situations, will provide them with practical insight into the theory.
nb: Praktisk trening i form av en øvelse, der kadettene møter situasjoner vil gi dem praktisk innsikt i teorien.

source: Hull and rudder design in relation to maneuvrability, fin model testing.
nb: Utforming av skrog og ror i forhold til manøvreringsevnen, modellforsøk av finne.

source: In Practice Module 3, the cadets will conduct a study tour in which the focus is engineering roles and engineering assignments in an international framework, primarily in NATO.
nb: Arbeidet foregår i tett samarbeid med blant annet Forsvarsbygg og ulike avdelinger i Hæren. Praksismodul 3 skal kadettene gjennomføre en studietur der fokuset er ingeniørroller og ingeniøroppgaver i en internasjonal ramme, primært i NATO.

source: • Scripting in Bash and PowerShell
nb: • Scripting i Bash og PowerShell

source: knowledge on key themes, theories, issues, processes, tools and methods within his/her thesis area of investigation
nb: kunnskap om sentrale temaer, teorier, problemstillinger, prosesser, verktøy og metoder innenfor sitt oppgaveområde

source: Parts of the course require physical attendance and participation from the Norwegian Military Academy at Linderud.
nb: Deler av emnet krever fysisk oppmøte og deltakelse fra Krigsskolen på Linderud.

source: Students establish strategic planning groups and analyse the SSA, before developing Military Response Options for the upcoming operations planning.
nb: Studentene etablerer strategiske plangrupper og analyserer SSA, før de utvikler militærstrategiske valg (Military Response Options) for den kommende operasjonsplanleggingen.

source: The cadets will here gain knowledge and experience as a troop commander, and become familiar with tasks and requirements such as these roles in their own weapon.
nb: Kadettene vil her få kunnskap og erfaringer som troppssjef og samvirkeoffiser, og blir kjent med oppgaver og krav som til disse rollene i eget våpen.

source: Damage mechanisms and error types, particularly in diesel engines.
nb: Skademekanismer og feiltyper, spesielt i dieselmaskineri.

source: Explain conditions that can impact a tactical operation in winter conditions.
nb: Forklare forhold som påvirker en taktisk operasjon under vinterforhold.

source: Joint Military Operations – Part 2
nb: Militære fellesoperasjoner – del 2

source: Time and time calculation.
nb: Tid og tidsregning.

source: Students will also have the opportunity to discuss dilemmas with a number of experts who have extensive experience from UN peacekeeping operations, including from the field, the UN headquarters in New York, and representatives from the Norwegian government.
nb: Studentene vil også få mulighet til å diskutere dilemmaer med en rekke eksperter som har bred erfaring fra FNs fredsoperasjoner, inkludert fra felt, hovedkvarteret i New York, og fra det norske embetsverket.

source: explain key concepts in academic methodology, decision theory and practice theory
nb: forklare sentrale begreper i vitenskapelig metode, slutningsteori og praksisteori

source: As part of Theme 2, cadets will reflect upon the demands on officers as leaders in times of war.
nb: I tema 2 skal kadettene reflektere over de krav som stilles til den enkelte offiser som leder i en krigssituasjon.

source: Choice of materials, global and local loads on the hull.
nb: Materialvalg, Globale og lokale laster på skroget.

source: Operational art and modern and post-modern war
nb: Operasjonskunst og moderne og postmoderne krigføring

source: communicate effectively in Norwegian and English, in writing and orally, during exercises and naval military operations and assess cultural factors
nb: kommunisere effektivt på norsk og engelsk, skriftlig og muntlig, ved øvelser og sjømilitære operasjoner og vurdere kulturelle faktorer

source: Metallic coatings and powder metallurgy.
nb: Metalliske belegg og pulvermetallurgi.

source: Marine high voltage installations, structure and operation, high voltage components, safety requirements when working in high-voltage marine installations.
nb: Maritime høyspenningsanlegg, oppbygning og virkemåte, høyspent komponenter, sikkerhetskrav ved arbeid i maritime høyspent anlegg.

source: provide examples of exhaust gas readings from combustion engines, methods for reduction and treatment, and emission regulations.
nb: gi eksempler på avgassmålinger fra forbrenningsmaskiner, metoder for reduksjon og behandling, samt utslippsbestemmelser.

source: Suggestions for thesis topics and statements are submitted before the end of teaching week 1 in semester 6.
nb: Forslag til emne og problemstilling leveres innen utløpet av undervisningsuke 1 i semester 6.

source: describe the Navy’s regulations on the subject and its concepts for maintenance and organisation.
nb: beskrive Sjøforsvarets regelverk innen emnet og dets konsepter for vedlikehold og organisering.

source: collect, evaluate, and contextualise historical knowledge
nb: innhente, evaluere, og kontekstualisere historisk kunnskap

source: use relevant mathematical and statistical systems of symbols and formulas and manipulate symbols and formulas
nb: benytte et relevant matematisk og statistisk symbol- og formelapparat og manipulere symboler og formler

source: Basic Leadership Skills Officer (GLF-O) is designed to be a tool for the basic leadership of a military unit.
nb: Grunnleggende lederferdigheter offiser (GLF-O) er å forstå som et verktøy for grunnleggende ledelse av militær avdeling.

source: • assess the performance of computer programs, in particular with regard to parallelism, caching and virtualisation
nb: • vurdere ytelsen til dataprogrammer, spesielt med tanke på parallellitet, caching og virtualisering

source: account for sivil-military relations and an principles in the Norwegian crisis management system.
nb: redegjøre for sivil-militære relasjoner og prinsipper i det norske krisehåndteringssystemet.

source: The course Joint Military Operations 2 will be thematically divided into two sections.
nb: Emnet militære fellesoperasjoner 2 vil tematisk være todelt.

source: find, evaluate and refer to information and professional material and present this so that it clarifies a practical problem.
nb: finne, vurdere og henvise til informasjon og fagstoff og framstille dette slik at det belyser en problemstilling.

source: relationships between issues, theories, methods and (military) practices
nb: sammenhenger mellom problemstillinger, teorier, metoder og (militær) praksis

source: The course's second topic will address military warfare levels and the military command structure, both nationally and within NATO.
nb: Emnets andre tema vil ta for seg militære krigføringsnivåer og den militære kommandostrukturen, både nasjonal og i NATO.

source: perform readings, analyse collected data and calculate thermal and mechanical conditions for main engines.
nb: gjennomføre målinger, analysere innsamlede data og beregne termiske og mekaniske forhold for hovedmaskineri.

source: apply probability concepts / words according to the E-doctrine
nb: anvende sannsynlighetsbegreper/ord i henhold til E-doktrinen

source: explain marine fuels and lubricants, production, parameters, properties, handling and control on board and related operational issues and health, safety and environmental issues.
nb: greie ut om marine brennstoffer og smøreoljer, produksjon, parametre, egenskaper, behandling og kontroll ombord samt relaterte driftsproblemer og helse, miljø og sikkerhets forhold.

source: Following the first session, an online activity is organised over three half-days.
nb: Etter første samling organiseres nettbasert aktivitet over tre halve dager.

source: The course uses It’s Learning or Teams.
nb: Faget bruker Itslearning eller Teams.

source: apply basic methods in transmission and digital signal processing.
nb: anvende grunnleggende metoder i transmisjon og digital signalbehandling.

source: Retrieved Feb 5th 2020 from
nb: Hentet 5. februar 2020 fra

source: By using different learning and reflection methods before, during, and after larger and smaller practice arenas, learning and development are enhanced.
nb: Ved bruk av forskjellige lærings- og refleksjonsmetoder i forkant, underveis og i etterkant av større og mindre praksisarenaer forsterkes læring og utvikling.

source: Additional reading for students using qualitative methods in their masters thesis (127 p.)
nb: Tilleggspensum for deg som skal bruke kvalitativ metode i masteroppgaven (127 s.):

source: A written and oral evaluation is held after the completed course and semester as a part of NDUC’s quality assurance system.
nb: Det gjennomføres skriftlig og muntlig evaluering etter avsluttet emne og semester som en del av FHS kvalitetssikringssystem.

source: Exhaust gas readings from gas turbine and methods for reduction and treatment.
nb: Avgassmålinger fra gassturbin og metoder for reduksjon og behandling.

source: Apply professional knowledge of stress reactions and coping with stress for self-preservation and the development of resilience
nb: anvende faglig kunnskap om stressreaksjoner og mestring av stress for egen selvivaretakelse og robusthetsutvikling

source: describe different collection methods and their applications
nb: beskrive ulike innsamlingsmetoder og deres anvendelsesområder

source: Explain key technology and what can be achieved with the weapons' effects and protection, sensors and countermeasures, and command, control, communications, data and information systems (C4IS).
nb: forklare sentral teknologi og hvilke effekter som kan oppnås innen våpenvirkning og beskyttelse, sensorer og motmidler, samt kommando-, kontroll-, kommunikasjons-, data og informasjonssystemer (C4IS).

source: Determination of a propeller's main dimensions, propulsion efficiency, cavitation problems, including propulsion and hull noise.
nb: Bestemmelse av en propells hoveddimensjoner, propulsjonsvirkningsgrad, kavitasjonsproblematikk, herunder støy fra propulsorer og skrog.

source: demonstrate basic knowledge in English with an emphasis on naval terminology (maritime English).
nb: bevise grunnleggende kunnskap i engelsk med vekt på sjømilitær terminologi (maritim engelsk).

source: • create and process simple data structures
nb: • opprette og behandle enkle datastrukturer

source: Discuss logistics in a crisis response perspective.
nb: Diskutere logistikk i et krise- responsperspektiv.

source: Naval English (NE)
nb: Sjømilitær engelsk (SE)

source: In addition, the Security Council issues ambitious mandates that UN operations often do not have sufficient resources to resolve.
nb: I tillegg utsteder Sikkerhetsrådet ambisiøse mandater som FN-operasjonene ofte ikke har ressurser nok til å løse.

source: • explain the principles of signal processing algorithms such as folding, correlation, discrete Fourier transform (DFT) and fast Fourier transform (FFT)
nb: • forklare det prinsippielle ved signalbehandlingsalgoritmer som folding, korrelasjon, diskret fourier transform (DFT) og fast fourier transform (FFT)

source: Multiplexing in time and frequency.
nb: Multipleksing i tid og frekvens.

source: • create and process simple data structures, including struct
nb: • opprette og behandle enkle datastrukturer, inklusive struct

source: • explain the manner of operation and technical principles for a modern microcontroller
nb: • forklare virkemåte og tekniske prinsipper for en moderne mikrokontroller

source: The purpose of the exercise is to review the knowledge and skills learned in semester 2.
nb: Hensikten med øvelsen er å repetere kunnskapen og ferdighetene fra semester 2.

source: The course shall give the cadets insight into logistics in the equipment’s lifetime, including integrated logistic support as a discipline and work method.
nb: Emnet skal gi kadettene innsikt i logistikk i materiellets levetid, herunder integrated logistic support som fagområde og arbeidsmetode.

source: plan and carry out varied work tasks and projects that extend over time, alone and as part of a group, and in line with ethical requirements and guidelines
nb: planlegge- og gjennomføre varierte arbeidsoppgaver og prosjekter som strekker seg over tid, alene og som deltager i en gruppe, og i tråd med etiske krav og retningslinjer

source: The course plan meets the International Convention on Standards of Training, Certification and Watchkeeping for Seafarers, STCW 1978 with amendments.
nb: Emneplanen oppfyller den internasjonale konvensjon om normer for opplæring, sertifikater og vakthold for sjøfolk, STCW, 1978 med tillegg.

source: Tolerance and fittings, standards.
nb: Toleranse og pasninger, standarder.

source: Compressor and turbine maps.
nb: Kompressor- og turbinkart.

source: Chapter 1.5 Establish watchkeeping arrangements and procedures
nb: Kapittel 1.5 Brovakthold og prosedyrer

source: • Electromagnetic waves
nb: • Elektromagnetiske bølger

source: explain the design of machine parts, manner of operation, mechanical strength and limitations.
nb: forklare maskindelers utforming, virkemåte, mekaniske styrke og begrensninger.

source: Lubricating oils, production, requirements, additives, qualities and classification.
nb: Smøreoljer, produksjon, krav, additiver, kvaliteter og klassifikasjon.

source: The students enter into a written, binding supervisionagreement with the supervisor and NDUC.
nb: Det er obligatorisk med veiledning av masteroppgaven, og studentene inngår en skriftlig, forpliktende veiledningsavtale med veileder og FHS.

source: English is taught in the third year in parallel with MILM3404 and MILM3405.
nb: Engelsk undervises på tredjeåret parallelt med MILM3404 og MILM3405.

source: Week 2: Human security and multidimensional/integrated operations
nb: Uke 2: Menneskelig sikkerhet og integrerte operasjoner

source: reflect on his/her own professional practice and adjust this under supervision.
nb: reflektere over egen faglig utøvelse og justere denne under veiledning.
